## Predicting Customer Revenue with Rule-Based Classification

**Work Problem**

*A gaming company wants to create level-based new customer personas using some of their customer characteristics and form segments based on these new customer personas, and estimate how much they can earn from these new customers based on these segments.*

*For example, they want to determine the average amount that a 25-year-old male user in Turkey who uses IOS can earn.*

**Data Set Story**

*The "Persona.csv" data set contains the prices of products sold by an international gaming company and some demographic information of the users who purchased these products.
The data set is made up of records generated from each sale transaction.
This means that the table has not been de-duplicated.
In other words, a user with specific demographic characteristics may have made multiple purchases.*

###### Price: Spending amount of the customer
###### Source: Type of device connected by the customer
###### Sex: Gender of the customer
###### Country: Country of the customer
###### Age: Age of the customer

#### *PROJECT TASKS*

##### TASK 1: Please answer the following questions

###### Q 1: read the persona.csv  and show general information about the data set.

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as pld
pd.set_option('display.max_columns', None)
pd.set_option('display.width', 500)

df = pd.read_csv('/Users/yagizkarakaya/Desktop/DSMLBootcamp/Kural Tabanlı Sınıflandırma/persona.csv')
df.info()
df.shape
df.head()
df.isnull().sum()
df.nunique()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5000 entries, 0 to 4999
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   PRICE    5000 non-null   int64
 1   SOURCE   5000 non-null   object
 2   SEX      5000 non-null   object
 3   COUNTRY  5000 non-null   object
 4   AGE      5000 non-null   int64
dtypes: int64(2), object(3)
memory usage: 234.4+ KB

PRICE       6
SOURCE      2
SEX         2
COUNTRY     6
AGE        46
dtype: int64

###### Q 2: How many unique SOURCES are there? What are their frequencies?

In [2]:
df['SOURCE'].nunique()
df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

###### Q 3: How many unique PRICE are there?

In [3]:
df['PRICE'].nunique()

6

###### Q 4: How many sales were made for each PRICE?

In [4]:
df['PRICE'].value_counts()

29    1305
39    1260
49    1031
19     992
59     212
9      200
Name: PRICE, dtype: int64

###### Q 5: How many sales were made for each COUNTRY?

In [5]:
df['COUNTRY'].value_counts()

usa    2065
bra    1496
deu     455
tur     451
fra     303
can     230
Name: COUNTRY, dtype: int64

###### Q 6: How much has been earned in total from sales by COUNTRY?

In [6]:
df.groupby('COUNTRY').agg({'PRICE': 'sum'}).sort_values('PRICE', ascending=False)

         PRICE
COUNTRY
usa      70225
bra      51354
tur      15689
deu      15485
fra      10177
can       7730

###### Q 7: What are the number of sales by type of SOURCE?

In [7]:
df['SOURCE'].value_counts()

android    2974
ios        2026
Name: SOURCE, dtype: int64

###### Q 8: What are the average PRICES by COUNTRY?

In [8]:
df.groupby('COUNTRY').agg({'PRICE': 'mean'})

             PRICE
COUNTRY
bra      34.327540
can      33.608696
deu      34.032967
fra      33.587459
tur      34.787140
usa      34.007264

###### Q 9: What are the average PRICES by SOURCE?

In [9]:
df.groupby('SOURCE').agg({'PRICE': 'mean'})

             PRICE
SOURCE
android  34.174849
ios      34.069102

###### Q 10: What are the average PRICES in the COUNTRY-SOURCE breakdown?

In [10]:
df.groupby(['COUNTRY', 'SOURCE']).agg({'PRICE': 'mean'})

                     PRICE
COUNTRY SOURCE
bra     android  34.387029
        ios      34.222222
can     android  33.330709
        ios      33.951456
deu     android  33.869888
        ios      34.268817
fra     android  34.312500
        ios      32.776224
tur     android  36.229437
        ios      33.272727
usa     android  33.760357
        ios      34.371703

#### TASK 2: What are the average earning in the breakdown of COUNTRY, SOURCE, SEX and AGE ?

In [11]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).head()

                                PRICE
COUNTRY SOURCE  SEX    AGE
bra     android female 15   38.714286
                       16   35.944444
                       17   35.666667
                       18   32.255814
                       19   35.206897

#### TASK 3: Sort the output by PRICE.

In [12]:
df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).sort_values('PRICE')

                            PRICE
COUNTRY SOURCE  SEX    AGE
deu     android male   26     9.0
usa     ios     female 38    19.0
tur     ios     male   47    19.0
        android male   21    19.0
fra     android male   18    19.0
...                           ...
deu     ios     male   20    49.0
usa     ios     male   32    54.0
bra     android male   46    59.0
fra     android female 24    59.0
usa     android male   36    59.0

[348 rows x 1 columns]

######  To better visualize the output from the previous question, apply the sort_values method to PRICE in descending order. Save the output as agg_df.

In [13]:
agg_df = df.groupby(['COUNTRY', 'SOURCE', 'SEX', 'AGE']).agg({'PRICE': 'mean'}).sort_values('PRICE', ascending=False)
print(agg_df.head())

                            PRICE
COUNTRY SOURCE  SEX    AGE
bra     android male   46    59.0
usa     android male   36    59.0
fra     android female 24    59.0
usa     ios     male   32    54.0
deu     android female 36    49.0

#### TASK 4: Convert to names in the index to the variable name.

###### In the output of the third question, all variables except PRICE are index names
###### hint: reset_index()
###### agg_df.reset_index(inplace=True)

In [14]:
agg_df.reset_index(inplace=True)
agg_df.head()

  COUNTRY   SOURCE     SEX  AGE  PRICE
0     bra  android    male   46   59.0
1     usa  android    male   36   59.0
2     fra  android  female   24   59.0
3     usa      ios    male   32   54.0
4     deu  android  female   36   49.0

#### TASK 5: Convert the AGE variable to a categorical variable and add it to agg_df

###### Convert the AGE numerical variable to a categorical variable.
###### Create the ranges in a way that you believe will be convincing.
###### For example: '0_18', '19_23', '24_30', '31_40', '41_70'

In [15]:
bins = [0, 18, 23, 30, 40, 70]
labels = ['0_18', '19_23', '24_30', '31_40', '41_70']
agg_df["AGE_CAT"] = pd.cut(agg_df["AGE"], bins=[0, 18, 24, 30, 40, 70], labels=labels, right=True)

#### TASK 6: Define and add a new level based customer variable to the data set.

###### Define a variable called customer_level_based and add it to the data set.
###### After creating the customer_level_based values using a list comprehension, it is necessary to deduplicate these values.
###### For example, there could be multiple instances of the following statement: USA_ANDROID_MALE_0_18
###### We need to take these and group them by using groupby to get the average prices.

In [17]:
row = ["COUNTRY","SOURCE","SEX","AGE_CAT","AGE"]

In [18]:

agg_df['customer_level_based'] = [row[0].upper() + "_" + row[1].upper() + "_" + row[2].upper() + "_" + row[5].upper() for row in agg_df.values]

agg_df.head()
agg_df.drop(row, axis=1, inplace=True)

In [19]:
new_df = agg_df.groupby("customer_level_based").agg({"PRICE" : "mean"}).sort_values("PRICE",ascending=False)

In [20]:

new_df.reset_index(inplace=True)

new_df.head()

       customer_level_based      PRICE
0        TUR_IOS_MALE_31_40  42.333333
1  TUR_ANDROID_FEMALE_31_40  41.833333
2    TUR_ANDROID_MALE_24_30  40.611111
3    CAN_ANDROID_MALE_24_30  40.250000
4    BRA_ANDROID_MALE_41_70  40.041667

In [21]:

new_df["SEGMENTS"] = pd.qcut(new_df["PRICE"], 4,labels=["D","C","B","A"])

new_df.head()

       customer_level_based      PRICE SEGMENTS
0        TUR_IOS_MALE_31_40  42.333333        A
1  TUR_ANDROID_FEMALE_31_40  41.833333        A
2    TUR_ANDROID_MALE_24_30  40.611111        A
3    CAN_ANDROID_MALE_24_30  40.250000        A
4    BRA_ANDROID_MALE_41_70  40.041667        A

#### TASK 7: Segment the new customers (USA_ANDROID_MALE_0_18) into segments.

###### Segment them based on PRICE,
###### Add the segments to agg_df with the label "SEGMENT".,
###### Describe the segments.

In [22]:
new_df["SEGMENTS"] = pd.qcut(new_df["PRICE"], 4, labels=["D", "C", "B", "A"])

new_df.head()


new_df.groupby("SEGMENTS").agg({"PRICE": ["mean", "max", "sum"]})

              PRICE
               mean        max          sum
SEGMENTS
D         29.104729  32.244811   785.827672
C         33.357094  34.103727   900.641543
B         34.966008  35.923077   909.116210
A         38.163274  42.333333  1030.408411

#### TASK 8: Classify the new customers and estimate how much revenue they may bring in.

##### A 33-year-old Turkish woman using ANDROID belongs to which segment and what is the average expected income?

In [23]:
new_user= "TUR_ANDROID_FEMALE_31_40"
new_df[new_df["customer_level_based"] == new_user]

       customer_level_based      PRICE SEGMENTS
1  TUR_ANDROID_FEMALE_31_40  41.833333        A

##### A 35-year-old French woman who uses IOS, what segment does she belong to and what is the average expected income she earns?

In [24]:
new_user1 = "FRA_IOS_FEMALE_31_40"

new_df[new_df["customer_level_based"] == new_user1]

    customer_level_based      PRICE SEGMENTS
76  FRA_IOS_FEMALE_31_40  32.818182        C